/*
 *   제어문을 사용하는 이유 
 *     프로그램 순차적 => 위에서 아래로 이동하면서 실행 
 *     --------------------------------------
 *       순차문  조건문  반복문 
 *        |      |     | 같은 기능을 여러번 수행 
 *       문법    필요시에만 문장을 수행 
 *     => 상황에 따라 다른 기능을 수행할 수 있게 만든다 
 *     -----------------------------------------
 *     
 *     조건에 따라 다르게 동작 : if / switch   y x x-- x++ 
 *     반복 작업 수행 : while / for 
 *     ------------
 *       => 효율적인 코드 작성 
 *     
 *   자바 지원하는 제어문 
 *   조건문 
 *     **= 단일조건문 
 *         if(조건문) => 조건문 : 비교연산자 , 논리연산자 , 부정연산자 
 *         {             | true / false 
 *            실행문장 
 *         }
 *         => 오류 방지 => 처리가 안되는 문장 : 예외처리 
 *     **= 선택조건문 
 *         true / false일때 나눠서 작업 
 *         if(조건문)
 *         {
 *            조건 true
 *         }
 *         else
 *         {
 *            조건 false
 *         }
 *     = 다중조건문 : 조건에 맞는 문장만 수행 => 1개의 조건만 수행 
 *       -------- 간결하게 표현 
 *   선택문 : switch ~ case 
 *   반복문 : 
 *           while : 반복횟수가 지정이 안된 경우 
 *                   => 네트워크 / 데이터베이스 
 *           do~while : 반드시 한번 이상 수행 => 버린다 
 *           for : 반복횟수가 지정된 경우 
 *                   => 화면 출력 
 *   반복제어문 : break : 종료 
 *             continue : 특정부분을 제외 
 */
public class 제어문 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
