/*
 *   메소드 : 동작 / 행위를 구현 
 *          ---------- 기능 처리 
 *          1. 소스 간결 : 반복 제거 
 *             => 관련된 내용만 모아서 저장
 *             => 디버깅 / 추가 / 수정 
 *          2. 가독성 = 단락 
 *          3. 형식 , 동작 순서 , 호출 방식 
 *          --------------------------
 *          형식 
 *            = 메소드명 => 의미 부여 
 *                        => 7~15자리에서 만들어 진다
 *                        => 식별자 , 소문자 시작 
 *            = 리턴형 => 사용자 요청한 데이터에 대해
 *                       처리 결과값 
 *                       반드시 1개만 설정이 가능 
 *                       => 데이터가 많은 경우 
 *                          (배열/클래스)
 *            = 매개변수 => 사용자의 요청 값 
 *            
 *         리턴형 메소드명(매개변수...)
 *         -----
 *         {
 *            매개변수를 이용해서 => 결과값 추출 
 *            return 값;
 *                   -- 동일 (데이터형 동일)
 *         }
 *         
 *         => 호출 
 *            메소드명(매개변수값)
 *                   ------ 메소드 종료와 동시에 소멸 
 *            void aaa(int a)
 *            
 *            => aaa(10) 
 *       ---------------------------------------
 *       
 *            
 */
public class 메소드_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
