/*
 *   웹 개발 
 *   ------
 *   연산자 ===========> 오라클 / 자바스크립트 
 *     ***1. 산술연산자 
 *     2. 비교연산자 
 *     ***3. 증감연산자 
 *     ***4. 형변환연산자 
 *     5. 논리연산자 
 *     ***6. 부정연산자 
 *     7. 대입연산자 
 *     -------------
 *     
 *     자바 => JSP / SpringFramework / Spring-Boot 
 *            ------------------------------------ 웹 라이브러리
 *     자바스크립트 => VueJS / ReactJS / NextJS 
 *     오라클 => MySQL / MariaDB 
 *     --------------- CI/CD => 리눅스 명령어 
 *                              ----------
 *                              1. AWS => 우분투 
 *                              
 *     ---------------------------------------------
 *     비교연산자 : 결과값 true/false 
 *     --------
 *          1) 정수 
 *          2) 실수 
 *          3) 문자 
 *          4) 논리(boolean) 제한 => ==, !=
 *          ===> 문자열 / 날짜 => 비교가 불가능 
 *       1. == (같다) 
 *       2. != (같지 않다)
 *       3. < 작다
 *       4. > 크기  ====> 왼쪽  a>10 a<10
 *       5. <= 작거나 같다 
 *          ---  < == => 둘중 하나가 true면 true가 된다 
 *          6<=6  6<6 6==6
 *       6. >= 크거나 같다 
 *          ---   > ==
 *          
 *       사용처 : 조건문 / 반복문 
 *              if(비교연산자|논리연산자|부정연산자)
 *                 ------------------------ true/false 
 *              while(비교연산자|논리연산자|부정연산자)
 *              {
 *                 
 *              }
 *              
 *             
 *      
 */
public class 비교연산자 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
