/*
 *   변수 : 한개의 데이터값을 저장할 수 있는 메모리 공간의 이름 
 *                                  ---------------
 *                                  메모리는 주소/번지 
 *                                         -------
 *                                         | 별칭 
 *   1) 임시로 데이터값을 컴퓨터에 인식 => 재사용 
 *      변수 : 한개의 값 
 *      배열 : 같은 것 여러개 => 사과박스 , 배박스 
 *      클래스 : 다른 것 여러개 => 종합과일셋트 
 *      ----------------------------------- 메모리에 저장 
 *      File 
 *      ***RDBMS(오라클)
 *      ----------------------------------- 영구적으로 저장이 가능
 *      =>  프로그램은 저장 (데이터 관리) => CRUD
 *          C(Create) R(Read) U(Update) D(Delete)
 *            저장       출력      수정      삭제 
 *    2) 변수 => 읽기 / 쓰기(저장,수정) 
 *              ------------------
 *              | 기능 : setter / getter
 *    3) 메모리 크기 (데이터형) 
 *        정수 
 *          byte (1byte)
 *          ------------------
 *          int  (4byte)
 *          long  (8byte) 
 *          ------------------ l(L)
 *        실수 
 *          double (8byte) => 15자리(정밀도)
 *        문자
 *          char (2byte) => 0~65535
 *        논리
 *          boolean (1byte) => true/false만 저장이 가능
 *    4) 변수 선언 
 *    5) 초기값 부여 
 *      
 */
public class 정리_2 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
